cms/app/controllers/main_controller.rb

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def index
    @main_page = Page.find(1)

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def show
    @page = Page.find(params[:id])