cms/app/controllers/pages_controller.rb

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def show
    @page = Page.find(params[:id])

INSERT INTO "pages" ("name", "created_at", "updated_at", "content") VALUES('test', '2009-05-12 00:59:00', '2009-05-12 00:59:00', '<h1>Hello</h1>')
---
  def create
    @page = Page.new(params[:page])
    if @page.save

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def edit
    @page = Page.find(params[:id])

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
UPDATE "pages" SET "updated_at" = '2009-05-15 02:59:46', "content" = 'this is my cms awesome ' WHERE "id" = 2
---
  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(params[:page])